//-----------------------------------------------------------------
// 程序描述:
// 		 外部中断驱动程序
// 作    者: 凌智电子
// 开始日期: 2018-08-04
// 完成日期: 2018-08-04
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2018-08-04)外部中断初始化，中断时执行相应的事情
// 调试工具: 凌智STM32F429+Cyclone IV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "exti.h"
#include "spi.h"
#include "delay.h"
//-----------------------------------------------------------------

extern u8 flog;
extern u32 ch1_data;
extern u32 ch2_data;
extern u16 point_cnt;

//-----------------------------------------------------------------
// void EXTI_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: 外部中断初始化
// 入口参数: 无
// 返回参数: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void EXTI_Init(void)
{
	GPIO_InitTypeDef GPIO_Initure;
	
	__HAL_RCC_GPIOE_CLK_ENABLE();
	
	GPIO_Initure.Pin=GPIO_PIN_9; 						 		 // ADS1292_DRDY -> PE9
	GPIO_Initure.Mode=GPIO_MODE_IT_FALLING;      // 下升沿触发
	GPIO_Initure.Pull=GPIO_PULLUP;							 // 上拉
	HAL_GPIO_Init(GPIOE,&GPIO_Initure);

	// 中断线9_5-PE9
	HAL_NVIC_SetPriority(EXTI9_5_IRQn,2,0);    // 抢占优先级为2，子优先级为0
	HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);          // 使能中断线9_5
}

//-----------------------------------------------------------------
// void EXTI9_5_IRQHandler(void)
//-----------------------------------------------------------------
//
// 函数功能: 中断线9-5中断服务函数，调用中断处理公用函数
// 入口参数: 无
// 返回参数: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void EXTI9_5_IRQHandler(void)
{
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_9);// 调用中断处理公用函数
}

//-----------------------------------------------------------------
// void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
//-----------------------------------------------------------------
//
// 函数功能: 中断服务程序中需要做的事情
// 入口参数: uint16_t GPIO_Pin：中断引脚
// 返回参数: 无
// 注意事项: 在HAL库中所有的外部中断服务函数都会调用此函数
//
//-----------------------------------------------------------------
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if(GPIO_Pin==GPIO_PIN_9)
	{
		u8 j;
		u8 read_data[9];
		
		for (j = 0; j < 9; j++)		// 连续读取9个数据
		{
			read_data[j] = SPI5_ReadWrite_Byte(0xFF);
		}
		ch1_data=0;
		ch2_data=0;
		ch1_data |= (uint32_t)read_data[3] << 16;
		ch1_data |= (uint32_t)read_data[4] << 8;
		ch1_data |= (uint32_t)read_data[5] << 0;
		ch2_data |= (uint32_t)read_data[6] << 16;
		ch2_data |= (uint32_t)read_data[7] << 8;
		ch2_data |= (uint32_t)read_data[8] << 0;
		point_cnt++;
		flog=1;
	}
}
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
